IDENTIFICATION DIVISION.
PROGRAM-ID.    SYSDATE.

ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
   01  WS-TDY-DATE.
       05 WS-TDY-YEAR   PIC 9(4).
       05 WS-TDY-MONTH  PIC 9(2).
       05 WS-TDY-DAY    PIC 9(2).
PROCEDURE DIVISION.
   ACCEPT WS-TDY-DATE FROM DATE YYYYMMDD.
   DISPLAY "This is the date today:", WS-TDY-MONTH, "-", 
           WS-TDY-DAY, "-", WS-TDY-YEAR. 

STOP RUN.
